#Область ПрограммныйИнтерфейс

Процедура ОтсортироватьМассив(ПоВозрастанию) Экспорт

	Для индекс = 1 По СортируемыйМассив.Количество()-1 Цикл
		ТекущееЗначение = СортируемыйМассив[индекс].Число;
		// Вставляем наше значение в нужное место
		ИндексВставки = индекс - 1;
		Пока ИндексВставки > -1 
			И ПродолжатьИзмененияМассива(ПоВозрастанию, ТекущееЗначение, СортируемыйМассив[ИндексВставки].Число) Цикл
			СортируемыйМассив[ИндексВставки + 1].Число = СортируемыйМассив[ИндексВставки].Число;
			ИндексВставки = ИндексВставки - 1;
			СортируемыйМассив[ИндексВставки + 1].Число = ТекущееЗначение;
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий



#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПродолжатьИзмененияМассива(ПоВозрастанию, НашеЗначение, ПредыдущееЗначение)

	Продолжать = Ложь;
	Если ПоВозрастанию Тогда
		Продолжать = ПредыдущееЗначение > НашеЗначение;
	Иначе
		Продолжать = ПредыдущееЗначение < НашеЗначение;
	КонецЕсли;
	Возврат Продолжать;

КонецФункции // ПродолжатьИзмененияМассива()


#КонецОбласти