Процедура ОтсортироватьМассив() Экспорт

	Для индекс = 1 По СортируемыйМассив.Количество()-1 Цикл
		ключ = СортируемыйМассив[индекс].Число;
		// Вставляем наше значение в нужное место
		индексвставки = индекс - 1;
		Пока индексвставки > -1 И СортируемыйМассив[индексвставки].Число > ключ Цикл
			СортируемыйМассив[индексвставки + 1].Число = СортируемыйМассив[индексвставки].Число;
			индексвставки = индексвставки - 1;
			СортируемыйМассив[индексвставки + 1].Число = ключ;
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры
