#Область ОбработчикиСобытийФормы



#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СортироватьПоВозрастанию(Команда)

	ОтсортироватьНаСервере(Истина);

КонецПроцедуры

&НаКлиенте
Процедура СортироватьПоУбыванию(Команда)

	ОтсортироватьНаСервере(Ложь);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСортируемыйМассив



#КонецОбласти

#Область ОбработчикиКомандФормы



#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОтсортироватьНаСервере(ПоВозрастанию)

	Если Не МожноСортировать() Тогда
		Возврат;
	КонецЕсли;
	ТекОбъект = РеквизитФормыВЗначение("Объект");
	ТекОбъект.ОтсортироватьМассив(ПоВозрастанию);
	ЗначениеВРеквизитФормы(ТекОбъект, "Объект");

КонецПроцедуры

&НаСервере
Функция МожноСортировать()

	Сортировать = Объект.СортируемыйМассив.Количество() > 1;
	Возврат Сортировать;

КонецФункции // МожноСортировать()

#КонецОбласти